//===========================================================================
//文件名称：arm_cm4.c
//功能概要：ARM Cortex-M4内核提供功能定义的源文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-10-09   V1.0     初始版本
//===========================================================================

#include "common.h"


//============================================================================
//函数名称：stop
//函数返回：无
//参数说明：无
//功能概要：设置CPU为STOP模式
//============================================================================
void stop (void)
{
    //置位SLEEPDEEP使能STOP模式
    BSET(SCB_SCR_SLEEPDEEP_SHIFT, SCB_SCR);
    //进入STOP模式
    asm("WFI");
}

//============================================================================
//函数名称：wait
//函数返回：无
//参数说明：无
//功能概要：设置CPU为WAIT模式
//============================================================================
void wait (void)
{
    //清SLEEPDEEP位来确定进入WAIT模式
    BCLR(SCB_SCR_SLEEPDEEP_SHIFT, SCB_SCR);
    //进入WAIT模式
    asm("WFI");
}

//===========================================================================
//函数名称：write_vtor
//函数返回：vtor：要更改的值
//参数说明：无
//功能概要：更改中断向量表偏移寄存器的值 
//===========================================================================
void write_vtor (uint_16_t vtor)
{
    //写新值
    SCB_VTOR = vtor;	
}

//============================================================================
//函数名称：enable_irq
//函数返回：无  
//参数说明：irq：irq号
//功能概要：使能irq中断 
//============================================================================
void enable_irq (uint_16_t irq)
{
    uint_16_t div;

    //确定irq号为有效的irq号
    if (irq > 91)	irq=91;
    
    //确定对应的NVICISER
    div = irq/32;

    switch (div)
    {
    	case 0x0:
            NVICICPR0 = 1 << (irq%32);
            NVICISER0 = 1 << (irq%32);
            break;
    	case 0x1:
            NVICICPR1 = 1 << (irq%32);
            NVICISER1 = 1 << (irq%32);
            break;
    	case 0x2:
            NVICICPR2 = 1 << (irq%32);
            NVICISER2 = 1 << (irq%32);
            break;
    	default:
    		break;
    }              
}

//============================================================================
//函数名称：disable_irq
//函数返回：无      
//参数说明：irq：irq号
//功能概要：禁止irq中断 
//============================================================================
void disable_irq (uint_16_t irq)
{
    uint_16_t div;

    //确定irq号为有效的irq号
    if (irq > 91)	irq=91;
    
    //确定对应的NVICISER
    div = irq/32;

    switch (div)
    {
        case 0:
            NVICICER0 = 1 << (irq%32);
            break;
    	case 1:
            NVICICER1 = 1 << (irq%32);
            break;
    	case 2:
            NVICICER2 = 1 << (irq%32);
            break;
    	default:
    		break;
    }              
}
 
//============================================================================
//函数名称：set_irq_priority
//函数返回：无      
//参数说明：irq：irq号         											   
//         prio：优先级
//功能概要：设置irq中断和优先级 
//============================================================================
void set_irq_priority (uint_16_t irq, uint_16_t prio)
{
    uint_8_t *prio_reg;

    //确定irq号和优先级有效
    if (irq > 91)	irq = 91;
    if (prio > 15)	prio = 15;

    //确定对应的NVICISER
    prio_reg = (uint_8_t *)(((uint_32_t)&NVICIP0) + irq);
    //设置优先级
    *prio_reg = ( (prio&0xF) << (8 - ARM_INTERRUPT_LEVEL_BITS) );             
}

