//============================================================================
//文件名称：speed.h
//功能概要：测速构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-02-02   V2.0
//============================================================================

#include "speed.h"

//=================接口函数声明===============================================
//============================================================================
//函数名称：speed_init
//函数参数：port_pin：设定接收速度信号的的引脚，
//          格式为：(端口号)|(引脚号)（如：(PORTD)|(1) 表示为D口一号脚）
//函数返回：无
//功能概要：测速模块初始化。
//============================================================================
void speed_init(uint16_t port_pin)
{
	//对应引脚的初始化，配置和开启引脚中断
	gpio_init(port_pin,0,0);     //将传入的引脚初始化为输入，初始状态为低电平
	gpio_pull(port_pin,0);       //将传入的引脚拉低电平
	gpio_enable_int(port_pin,10);//引脚中断类型设定为下降沿触发
}

//============================================================================
//函数名称：speed_get
//函数参数：无
//函数返回：返回类型为int，速度单位毫米每秒(mm/s)
//功能概要：获得当前速度。
//============================================================================
int speed_get()
{
	int speed = 0, time = SYSTICK_TIME;

	// 根据轮子半径求出速度
	speed = (int)(1000 * 2 * 3.14 * WHEEL_R * count/(RESOLU*time));

	// 判断速度的方向（暂未用）
//	if(judge)
//	{
//		speed = -speed;
//	}

	return speed;
}

