//===========================================================================
//文件名称：speed.h
//功能概要：测速构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-02-02   V2.0
//===========================================================================

#ifndef SPEED_H_
#define SPEED_H_

//头文件包含
#include "includes.h"
#include "common.h"    //包含公共要素头文件
#include "gpio.h"      //用到gpio构件

#define RESOLU        200        //分辨率 (200表示200脉冲每转)
#define WHEEL_R       22         //轮子半径 （mm）单位毫米
#define SPEED_PINL    (PORTD|1)    //定义接受速度信号的引脚，引脚只设定了一个，应加入一个，中断函数需要修改
#define SPEED_PINR    (PORTD|2)
#define SYSTICK_TIME  50           //定义测量一次车速的时间，单位ms
//=================接口函数声明===============================================
//============================================================================
//函数名称：speed_init
//函数参数：port_pin：设定接收速度信号的的引脚，
//          格式为：(端口号)|(引脚号)（如：(PORTD)|(1)表示为D口1号脚）
//函数返回：无
//功能概要：测速模块初始化。
//============================================================================
void speed_init(uint16_t port_pin);

//============================================================================
//函数名称：speed_get
//函数参数：无
//函数返回：返回类型为int，速度单位毫米每秒(mm/s)
//功能概要：获得当前速度。
//============================================================================
int speed_get();

#endif /* SPEED_H_ */

